#***************************************************
# Timing constraint file in PT format
#
# - Note: This is all case-sensitive
#***************************************************

#***************************************************
# Clock Constraints	
#***************************************************
create_clock  -period 100.0000000 -waveform { 0.0000000 50.0000000}\
   [get_ports {clk}]


#***************************************************
# Input Pin Constraints
#***************************************************	 
set_input_delay -clock clk 1.0000 \
   [get_ports {n_rst}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {d_plus_in}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {d_minus_in}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {in_pwr}] 
set_input_delay -clock clk 1.0000 \
   [get_ports {in_gnd}]

#***************************************************
# Output Pin Constraints
#***************************************************
set_output_delay -clock clk 1.0000 \
   [get_ports {d_plus_out}] 
set_output_delay -clock clk 1.0000 \
   [get_ports {d_minus_out}] 
set_output_delay -clock clk 1.0000 \
   [get_ports {out_pwr}] 
set_output_delay -clock clk 1.0000 \
   [get_ports {out_gnd}] 

#***************************************************
# Pin Driving Cells (Needed only for Inputs)
#***************************************************
set_driving_cell -lib_cell INVX8\
   [get_ports {clk}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {n_rst}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {d_plus_in}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {d_minus_in}] 
set_driving_cell -lib_cell INVX8\
   [get_ports {in_pwr}]
set_driving_cell -lib_cell INVX8\
   [get_ports {in_gnd}] 
